# Hypothesis Testing

Craig Gossen

**The stakeholder is asking does the MPAA rating of a movie (G/PG/PG-13/R) affect how much revenue the movie generates?**

The following project performs hypothesis testing on this question along with 2 other relevant movie questions.

### Load and clean data

In [1]:
#Imports
import json
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import glob
from scipy import stats

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
#Collect final data filenames
q = 'Data/final*.csv.gz'
file_list = sorted(glob.glob(q))
file_list

['Data\\final_tmdb_data_2000.csv.gz', 'Data\\final_tmdb_data_2001.csv.gz']

In [3]:
#Connect MySQL
username = 'root'
password = 'root'
db_name = 'movies'
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}' #format is  dialect+driver://username:password@host:port/database
engine = create_engine(connection) 
engine #to verify engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [4]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [5]:
sql = """
SHOW TABLES
;
"""
pd.read_sql_query(sql, engine)

  Tables_in_movies
0           genres
1     title_basics
2    title_ratings
3    titles_genres
4        tmdb_data

In [6]:
sql = """
SELECT *
FROM
    genres
LIMIT 
    5
;
"""
pd.read_sql_query(sql, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [7]:
sql = """
SELECT *
FROM
    title_basics
LIMIT 
    5
;
"""
pd.read_sql_query(sql, engine)

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama

In [8]:
sql = """
SELECT *
FROM
    title_ratings
LIMIT 
    5
;
"""
pd.read_sql_query(sql, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1947
1  tt0000002            5.8       264
2  tt0000005            6.2      2580
3  tt0000006            5.1       177
4  tt0000007            5.4       810

In [9]:
sql = """
SELECT *
FROM
    title_basics
LIMIT 
    5
;
"""
pd.read_sql_query(sql, engine)

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama

In [10]:
sql = """
SELECT *
FROM
    titles_genres
LIMIT 
    5
;
"""
pd.read_sql_query(sql, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [11]:
sql = """
SELECT *
FROM
    tmdb_data
LIMIT 
    5
;
"""
pd.read_sql_query(sql, engine)

      tconst     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

# Does the MPAA/certification rating affect the revenue?

*Null Hypothesis:* the certification **does not** affect the revenue of a movie

*Alternative Hypothesis:* the certification **does** affect the revenue of a movie

The target is revenue which contains numeric data. There are 7 certification types which are categorical. An ANOVA and/or Tukey test will be ran. 

Assumptions include:
1. Normality
2. Equal variance
3. Outliers

The hypothesis test will be stats.f_oneway() for One Way ANOVA. 

Alpha = 0.05

In [12]:
sql = """
SELECT tm.revenue, tm.certification
FROM
    tmdb_data AS tm
;
"""
df1 = pd.read_sql_query(sql, engine)
df1

         revenue certification
0     76019000.0         PG-13
1            0.0          None
2            0.0          None
3            0.0          None
4            0.0          None
...          ...           ...
2511         0.0          None
2512         0.0          None
2513         0.0          None
2514         0.0            NR
2515         0.0          None

[2516 rows x 2 columns]

In [13]:
#Determine count of categories
df1['certification'].value_counts().sort_index(ascending = False)

Unrated      1
R          456
PG-13      183
PG          63
NR          68
NC-17        6
G           24
-            1
Name: certification, dtype: int64

In [14]:
#Check for NaN
df1['certification'].isna().sum()

1714

In [15]:
#Drop NaN
df1.dropna(inplace=True)

In [16]:
#Find and drop the dash row
#age_filter = df1['certification'] == '-'
#df1[age_filter]

In [17]:
#df1.drop(1868, inplace = True)

In [18]:
#Remove the certification which a dash
df1 = df1.loc[ df1['certification'] != '-']

In [19]:
df1['certification'].value_counts().sort_index(ascending = False)

Unrated      1
R          456
PG-13      183
PG          63
NR          68
NC-17        6
G           24
Name: certification, dtype: int64